<?xml version="1.0" ?>
<net name="vgg11_best" version="10">
	<layers>
		<layer id="0" name="3383421156" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="3393431240" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="3403441126" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="3413451279" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="4534571267" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="4544581351" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="4554591147" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="4564601102" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="2282321198" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="2292331171" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="2302341144" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="2312351162" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="2782821090" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="2792831207" type="Const" version="opset1">
			<data element_type="f32" offset="2064" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="2802841117" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="2812851165" type="Const" version="opset1">
			<data element_type="f32" offset="2064" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="114911282" type="Const" version="opset1">
			<data element_type="f32" offset="4112" shape="512,512,3,3" size="9437184"/>
			<output>
				<port id="0" names="114" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_16/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="4734771084" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="4744781255" type="Const" version="opset1">
			<data element_type="f32" offset="9441296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="4754791225" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="4764801108" type="Const" version="opset1">
			<data element_type="f32" offset="9441296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="1881921243" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="1891931189" type="Const" version="opset1">
			<data element_type="f32" offset="9441300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="1901941324" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="1911951306" type="Const" version="opset1">
			<data element_type="f32" offset="9441300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2182221105" type="Const" version="opset1">
			<data element_type="f32" offset="9441304" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="2192231336" type="Const" version="opset1">
			<data element_type="f32" offset="9443352" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="2202241210" type="Const" version="opset1">
			<data element_type="f32" offset="9441304" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="2212251354" type="Const" version="opset1">
			<data element_type="f32" offset="9443352" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="108801303" type="Const" version="opset1">
			<data element_type="f32" offset="9445400" shape="512,256,3,3" size="4718592"/>
			<output>
				<port id="0" names="108" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_11/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="4634671315" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="4644681201" type="Const" version="opset1">
			<data element_type="f32" offset="14163992" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="4654691294" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="4664701237" type="Const" version="opset1">
			<data element_type="f32" offset="14163992" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="1681721186" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="1691731129" type="Const" version="opset1">
			<data element_type="f32" offset="14163996" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="1701741099" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="1711751333" type="Const" version="opset1">
			<data element_type="f32" offset="14163996" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="2983021219" type="Const" version="opset1">
			<data element_type="f32" offset="14164000" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="2993031327" type="Const" version="opset1">
			<data element_type="f32" offset="14165024" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="3003041222" type="Const" version="opset1">
			<data element_type="f32" offset="14164000" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="3013051204" type="Const" version="opset1">
			<data element_type="f32" offset="14165024" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="102691300" type="Const" version="opset1">
			<data element_type="f32" offset="14166048" shape="256,128,3,3" size="1179648"/>
			<output>
				<port id="0" names="102" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_6/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="4934971342" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="4944981330" type="Const" version="opset1">
			<data element_type="f32" offset="15345696" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="4954991348" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="4965001228" type="Const" version="opset1">
			<data element_type="f32" offset="15345696" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="2582621345" type="Const" version="opset1">
			<data element_type="f32" offset="15345700" shape="128,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="2592631123" type="Const" version="opset1">
			<data element_type="f32" offset="15346212" shape="128,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="2602641264" type="Const" version="opset1">
			<data element_type="f32" offset="15345700" shape="128,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="2612651270" type="Const" version="opset1">
			<data element_type="f32" offset="15346212" shape="128,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="99631078" type="Const" version="opset1">
			<data element_type="f32" offset="15346724" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="0" names="99" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_3/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="4834871246" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="4844881087" type="Const" version="opset1">
			<data element_type="f32" offset="15641636" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="4854891072" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="4864901177" type="Const" version="opset1">
			<data element_type="f32" offset="15641636" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="3083121174" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="3093131309" type="Const" version="opset1">
			<data element_type="f32" offset="15641640" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="3103141132" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="3113151234" type="Const" version="opset1">
			<data element_type="f32" offset="15641640" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,128,128"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_0/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="3183221258" type="Const" version="opset1">
			<data element_type="f32" offset="15641644" shape="64,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="3193231216" type="Const" version="opset1">
			<data element_type="f32" offset="15641900" shape="64,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="3203241081" type="Const" version="opset1">
			<data element_type="f32" offset="15642156" shape="64,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="3213251276" type="Const" version="opset1">
			<data element_type="f32" offset="15642412" shape="64,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="96571135" type="Const" version="opset1">
			<data element_type="f32" offset="15642668" shape="64,3,3,3" size="6912"/>
			<output>
				<port id="0" names="96" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_0/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_0/Dims451591261" type="Const" version="opset1">
			<data element_type="f32" offset="15649580" shape="1,64,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="95" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="61" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="MaxPool_2/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="MaxPool_2" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="62" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_3/Dims439651339" type="Const" version="opset1">
			<data element_type="f32" offset="15649836" shape="1,128,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="98" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="65" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="MaxPool_5/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="MaxPool_5" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="66" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_6/Dims409711318" type="Const" version="opset1">
			<data element_type="f32" offset="15650348" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="101" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="69" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_8/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="1781821195" type="Const" version="opset1">
			<data element_type="f32" offset="15651372" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1791831285" type="Const" version="opset1">
			<data element_type="f32" offset="15652396" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="1801841153" type="Const" version="opset1">
			<data element_type="f32" offset="15651372" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="1811851168" type="Const" version="opset1">
			<data element_type="f32" offset="15652396" shape="256,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="105741114" type="Const" version="opset1">
			<data element_type="f32" offset="15653420" shape="256,256,3,3" size="2359296"/>
			<output>
				<port id="0" names="105" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_8/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_8/Dims433761159" type="Const" version="opset1">
			<data element_type="f32" offset="18012716" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="104" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="72" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="MaxPool_10/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="MaxPool_10" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="73" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_11/Dims421821150" type="Const" version="opset1">
			<data element_type="f32" offset="18013740" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="107" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Relu_12" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="76" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_13/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="1982021288" type="Const" version="opset1">
			<data element_type="f32" offset="18015788" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="1992031183" type="Const" version="opset1">
			<data element_type="f32" offset="18017836" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="2002041192" type="Const" version="opset1">
			<data element_type="f32" offset="18015788" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="2012051120" type="Const" version="opset1">
			<data element_type="f32" offset="18017836" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="111851096" type="Const" version="opset1">
			<data element_type="f32" offset="18019884" shape="512,512,3,3" size="9437184"/>
			<output>
				<port id="0" names="111" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_13/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_13/Dims427871231" type="Const" version="opset1">
			<data element_type="f32" offset="27457068" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="110" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="79" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="MaxPool_15/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="MaxPool_15" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="80" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_16/Dims445931297" type="Const" version="opset1">
			<data element_type="f32" offset="27459116" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="113" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" names="83" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_18/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="2382421312" type="Const" version="opset1">
			<data element_type="f32" offset="27461164" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="2392431093" type="Const" version="opset1">
			<data element_type="f32" offset="27463212" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="2402441111" type="Const" version="opset1">
			<data element_type="f32" offset="27461164" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="2412451249" type="Const" version="opset1">
			<data element_type="f32" offset="27463212" shape="512,1,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="117961252" type="Const" version="opset1">
			<data element_type="f32" offset="27465260" shape="512,512,3,3" size="9437184"/>
			<output>
				<port id="0" names="117" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Conv_18/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1,1" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Conv_18/Dims415981180" type="Const" version="opset1">
			<data element_type="f32" offset="36902444" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="116" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Relu_19" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" names="86" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="MaxPool_20/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="MaxPool_20" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" names="87,89" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="AveragePool_23" type="AvgPool" version="opset1">
			<data auto_pad="explicit" exclude-pad="true" kernel="4,4" pads_begin="0,0" pads_end="0,0" rounding_type="floor" strides="4,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="90" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Constant_241031213" type="Const" version="opset1">
			<data element_type="i64" offset="36904492" shape="2" size="16"/>
			<output>
				<port id="0" names="91" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Reshape_25" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="92" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Relu_26" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="93" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Gemm_27/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="3483521138" type="Const" version="opset1">
